<template>
  <div>
    <GeneralTitleHeader
      :title="`الشروط و الأحكام`"
      :desc="`الشروط و الأحكام الخاصة بموقع لوحتك`"
    />
  </div>
  <div class="container">
    <div class="p-6 wow animate fadeIn" data-wow-delay=".1s">
      <h4 class="text-primary bg-gray-100 px-4 text-base py-2 w-fit rounded-md">
        شروط الاستخدام
      </h4>
      <p class="text-text-gray py-4">
        "المعلومات الشخصية" هي أي معلومات تتعلق بشخص طبيعي محدد أو يمكن تحديد
        هويته. ,"المعالجة" أو "المعالجة" تعني أي عملية يتم إجراؤها على المعلومات
        الشخصية. ,تعتمد أنواع أو فئات المعلومات الشخصية التي نجمعها وكيفية جمعها
        ومعالجتها على طبيعة العلاقة التي تربطك ببولت ومتطلبات القانون المعمول
        به. ,قد نقوم بجمع المعلومات التالية:
      </p>
      <p class="text-text-gray py-4">
        ,المعلومات التي تقدمها لنا مباشرة. ,نقوم بجمع المعلومات الشخصية التي
        تقدمها لنا مباشرة، بما في ذلك المعلومات الشخصية ومعلومات المعاملات عند
        استخدام خدمات Bolt، بما في ذلك معلومات حسابك مثل الاسم ورقم الهاتف
        وعنوان البريد الإلكتروني ورقم بطاقة الائتمان عند إنشاء حساب Bolt أو Bolt
        ,حساب التاجر، ومعلومات الاتصال الخاصة بك عندما تتواصل معنا، والمعلومات
        التي قد تقدمها لنا فيما يتعلق بالاستطلاعات أو المسابقات أو اليانصيب.
        ,عندما تتواصل مع Bolt (عبر البريد الإلكتروني أو الهاتف)، فإننا نجمع
        محتويات تلك الاتصالات، بما في ذلك تسجيل وقت المكالمة، ومدة المكالمة،
        ومحتويات المكالمات الهاتفية.
      </p>
      <p class="text-text-gray py-4">
        ,معلومات من مصادر أخرى. ,عند إجراء عملية شراء من أحد تجار Bolt باستخدام
        حساب Bolt Merchant الخاص بك، تقوم Bolt بجمع المعلومات التي قمت بشرائها
        مثل معلومات الطلب، ومعلومات الشحن، وتحديثات الطلب، وتكرار الشراء،
        ومعلومات حساب Bolt Merchant، وأي مكافآت أو خصومات تنطبق على عملية الشراء
        الخاصة بك. ,قد يحصل Bolt أيضًا على معلومات عنك من مصادر أخرى، بما في ذلك
        المعلومات العامة أو المتاحة تجاريًا ومن خلال شركاء الطرف الثالث ومقدمي
        الخدمات.
      </p>
    </div>
    <div class="p-6 wow animate fadeIn" data-wow-delay=".2s">
      <h4 class="text-primary bg-gray-100 px-4 text-base py-2 w-fit rounded-md">
        شروط الاستخدام لوحتك
      </h4>
      <p class="text-text-gray py-4">
        "المعلومات الشخصية" هي أي معلومات تتعلق بشخص طبيعي محدد أو يمكن تحديد
        هويته. ,"المعالجة" أو "المعالجة" تعني أي عملية يتم إجراؤها على المعلومات
        الشخصية. ,تعتمد أنواع أو فئات المعلومات الشخصية التي نجمعها وكيفية جمعها
        ومعالجتها على طبيعة العلاقة التي تربطك ببولت ومتطلبات القانون المعمول
        به. ,قد نقوم بجمع المعلومات التالية:
      </p>
      <p class="text-text-gray py-4">
        ,المعلومات التي تقدمها لنا مباشرة. ,نقوم بجمع المعلومات الشخصية التي
        تقدمها لنا مباشرة، بما في ذلك المعلومات الشخصية ومعلومات المعاملات عند
        استخدام خدمات Bolt، بما في ذلك معلومات حسابك مثل الاسم ورقم الهاتف
        وعنوان البريد الإلكتروني ورقم بطاقة الائتمان عند إنشاء حساب Bolt أو Bolt
        ,حساب التاجر، ومعلومات الاتصال الخاصة بك عندما تتواصل معنا، والمعلومات
        التي قد تقدمها لنا فيما يتعلق بالاستطلاعات أو المسابقات أو اليانصيب.
        ,عندما تتواصل مع Bolt (عبر البريد الإلكتروني أو الهاتف)، فإننا نجمع
        محتويات تلك الاتصالات، بما في ذلك تسجيل وقت المكالمة، ومدة المكالمة،
        ومحتويات المكالمات الهاتفية.
      </p>
      <p class="text-text-gray py-4">
        ,معلومات من مصادر أخرى. ,عند إجراء عملية شراء من أحد تجار Bolt باستخدام
        حساب Bolt Merchant الخاص بك، تقوم Bolt بجمع المعلومات التي قمت بشرائها
        مثل معلومات الطلب، ومعلومات الشحن، وتحديثات الطلب، وتكرار الشراء،
        ومعلومات حساب Bolt Merchant، وأي مكافآت أو خصومات تنطبق على عملية الشراء
        الخاصة بك. ,قد يحصل Bolt أيضًا على معلومات عنك من مصادر أخرى، بما في ذلك
        المعلومات العامة أو المتاحة تجاريًا ومن خلال شركاء الطرف الثالث ومقدمي
        الخدمات.
      </p>
    </div>
    <div class="p-6 wow animate fadeIn" data-wow-delay=".3s">
      <h4 class="text-primary bg-gray-100 px-4 text-base py-2 w-fit rounded-md">
        قواعد لمستخدمي لوحتك
      </h4>
      <p class="text-text-gray py-4">
        "المعلومات الشخصية" هي أي معلومات تتعلق بشخص طبيعي محدد أو يمكن تحديد
        هويته. ,"المعالجة" أو "المعالجة" تعني أي عملية يتم إجراؤها على المعلومات
        الشخصية. ,تعتمد أنواع أو فئات المعلومات الشخصية التي نجمعها وكيفية جمعها
        ومعالجتها على طبيعة العلاقة التي تربطك ببولت ومتطلبات القانون المعمول
        به. ,قد نقوم بجمع المعلومات التالية:
      </p>
    </div>
  </div>
</template>

<script setup>
const config = useRuntimeConfig();
const i18n = useI18n();

const { data: terms } = await useFetch(
  `${config.public.baseURL}api/general/term`,
  {
    headers: {
      "Accept-Language": i18n.locale.value,
    },
    params: {
      type: "terms-conditions",
    },
  }
);
</script>
